

#include <iostream>

int main()
{
    //선조건 : 어던 기능이 제대로 동작하기 위한 조건

    //후조건 : b에 0이 올 수 없다.

    //함수의 후조건 선조건 



    //선조건 : b에 0이 올 수 있다.


    //선조건과 후조건을 제대로 이해하지 못한 상태로 하면 
    //망한다.




    /*
    1. 지역 변수
    2. 전역 변수
    

    이때 생성되라 이때 종료되라 안해도 중괄호를 닫고 여는 것만으로 시작과 끝이 알려짐
    스택이라는 메모리 안에 생성ㅇ ㅣ됩니다.
    
    기계어로 마드는 과정 컴파일

    */
    //전역변수 선언 정의
    //링크 에러 

    //컴파일 에러가 날지 
    //링커 에러가 날지 보면서 해야 합니다.


    //다른 파일에서 전역 함수를 만들어보자

    /*
    extern void print();
      
    static 전역변수는 죽지않는 변수
    */

    // # include <stdio.h>
    // 
    //void print()


    //링크 에러는  빨간줄이 안남  

     
    // 자료형 앞에 붙어 있으면 배열
    // 변수만 딸랑 ㅣㅇ씀녀 그건 그냥 요소 접근 연산자
}

