#include <iostream>

int main()
{
    //조건문의 종류에는 2가지가 있음 
    /*
    
    1. if
    2. switch 
    
    */
    int age = 0;
    if (age >= 10)
    {
        printf("ㅋㅋ");
    }
    else
    {
        printf(" ㅋㅋㅋ");
    }
    //조건문은 우선순위를 잘 봐야한다 . 조건체크를 합시다.
    //else if 는 그냥 넘어가버림 조건문과 맞는 일이 생기면

 //   int month;
 //   switch (month)
 //   {

 //   //break 는 eles if 와 같다
 //    break;


 //    goto skip_code;



 //skip_code:
 //    printf("asdasd");
    //}


    //if 안에서 있따가 위로 다시 가기 가능




    //if 문 2번 쓰며 

/*
    for문은 주로 반복할 코드의 횟수를 명확하게 알 때 사용

    while문은 시작하면 언제 끝날지 모르는 상황에서 주로 쓰임

*/



    /*
    do
    {
        반복코드
    } while (반복 조건) ;// 세미콜론 붙여야 함
    

    while (반복 조건)
    {
        반복할 코드;
    }

    */





	    //(1일차, 1회) = > 1번 =
		//(1일차, 2회) = > 2번 =
		
        //(2일차, 1회) = > 3번 =
		//(2일차, 2회) = > 4번 =
		
        //(3일차, 1회) = > 5번 =
		//(3일차, 2회) = > 6번 =
		
        //(4일차, 1회) = > 7번 =
		//(4일차, 2회) = > 8번 =

    //==================================

    
}

